samples/ePA 1 Beispielnachrichten PS - Konnektor/Requests/getpinstatus.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <GetPinStatus xmlns="http://ws.gematik.de/conn/CardService/v8.1">
      <Context xmlns="http://ws.gematik.de/conn/ConnectorContext/v2.0">
        <MandantId xmlns="http://ws.gematik.de/conn/ConnectorCommon/v5.0">Mandant1</MandantId>
        <ClientSystemId xmlns="http://ws.gematik.de/conn/ConnectorCommon/v5.0">ClientID1</ClientSystemId>
        <WorkplaceId xmlns="http://ws.gematik.de/conn/ConnectorCommon/v5.0">CATS</WorkplaceId>
      </Context>
      <CardHandle xmlns="http://ws.gematik.de/conn/ConnectorCommon/v5.0">4da0a984-8124-475f-ab29-c4b78d4710b1</CardHandle>
      <PinTyp xmlns="http://ws.gematik.de/conn/CardServiceCommon/v2.0">PIN.SMC</PinTyp>
    </GetPinStatus>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
